Revit 2027 API
FormattedText.GetItalicStatus Method
Overload List
Name | Description
GetItalicStatus() |  Returns whether All, None or a Mixed of characters in the entire text are italic.
GetItalicStatus(TextRange) |  Returns whether All, None or a Mixed set of characters in a given text range are italic.
Top
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace